december454/Udemy-Embedded-Systems-STM32/5_uart_tx/Src/main.c
// Griffin White
// 3-23-2023
// 5 - UART Transmit
// Udemy - Embedded Systems Bare-Metal Programming Ground Up (STM32)

/* Video:	 Section 3: Videos 15 - 16.
 * Function: Demonstrate UART / serial output.
 */

#include "stdint.h"
#include "stm32f4xx.h"

#define SYS_FREQ			16000000
#define APB1_CLK			SYS_FREQ

#define UART_BAUDRATE		115200

#define GPIOAEN				(1U<<0)
#define UART2EN				(1U<<17)

#define CR1_TE				(1U<<3)
#define CR1_UE				(1U<<13)
#define SR_TXE				(1U<<7)


static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate);
static uint16_t compute_uart_bd (uint32_t PeriphClk, uint32_t BaudRate);
void uart2_write(int ch);
void uart2_tx_init(void);

int main (void){

	uart2_tx_init();

	while(1){
		uart2_write('Z');
	}
}

void uart2_tx_init(void){

	//////////////// Configure UART transmit GPIO pin ////////////////

	// Enable clock access to GPIOA.
	RCC->AHB1ENR |= GPIOAEN;

	// Set PA2 mode to alternate function mode.
	GPIOA->MODER &=~(1U<<4);
	GPIOA->MODER |= (1U<<5);

	// Set PA2 alternate function type to UART_TX (AF07).
	GPIOA->AFR[0] |=  (1U<<8);
	GPIOA->AFR[0] |=  (1U<<9);
	GPIOA->AFR[0] |=  (1U<<10);
	GPIOA->AFR[0] &= ~(1U<<11);

	//////////////// Configure UART module ////////////////

	// Enable clock access to UART2
	RCC -> APB1ENR |= UART2EN;

	// Configure baud rate.
	uart_set_baudrate(USART2,APB1_CLK, UART_BAUDRATE);

	// Configure transfer direction.
	USART2 -> CR1 = CR1_TE;

	// Enable UART module.
	USART2 -> CR1 |= CR1_UE;
}

void uart2_write(int ch){
	// Check that transmit data register is empty.
	while(!(USART2 -> SR & SR_TXE)){}
	// Write to transmit data register.
	USART2->DR = (ch & 0xFF);
}

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate){
	USARTx -> BRR = compute_uart_bd(PeriphClk, BaudRate);
}

static uint16_t compute_uart_bd (uint32_t PeriphClk, uint32_t BaudRate){
	return (PeriphClk + BaudRate/2U) / BaudRate;
}
